{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "",
    "link": "",
    "text": "Randy G"
  },
  "text": {
    "more": "Have you ever wanted to browse Spotify, but find its browsing for similar artists to be lackluster? This is for you.\n\n\nData captured allows one to see the top three genre descriptors as defined by Spotify, as well as Spotify popularity index and URI. \n\n\nThe Spotify popularity index is proprietary and thus we don\u0027t know exactly how it\u0027s calculated, however we know that it\u0027s a ranking system from 0-100 that ranks an artist relative to all other artists on the platform. This index seems to influence how an artist places on algorithmically made playlists and Spotify discovery and recommendation. It also seems to be derived from metrics such as the age of tracks, number of listens and saves among others, but it\u0027s not known for sure. However, I believe it\u0027s a useful metric for the end-user as it allows an \"at a glance\" look for an artist\u0027s popularity; that is, the higher the number, the higher chance the artist is well known.\n\n\nThe Spotify URI capture allows the user to copy/paste URI into Spotify and be directed to the artist\u0027s Spotify entry. I find this to be a more reliable way of searching for artists, especially with the similarly/exactly named artists. \n\n\nThe network itself is colored by modularity class; this statistic determines the number of clusters within some network. This highlights similar artist \"communities\", that may or not share the same reported genres but will be one the listener might like. The nodes are sized by their Betweenness Centrality, which is a number that represents how many times a node is \"walked over\" in shortest walk paths between two nodes. This easily highlights the \"bridge\" to various communities, and could serve as a \"gateway artist\" for these subgenres. I also list Eccentricity for each artist; this is the maximum distance between one node and any other node within the graph. This essentially shows how dissimilar each artist is from the rest of the group.",
    "intro": "A visualization of artists and their related artists from Spotify.",
    "title": "Artist Relationship Network"
  },
  "legend": {
    "edgeLabel": "Recommendation",
    "colorLabel": "Modularity Class",
    "nodeLabel": "Artist"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "Modularity Class",
    "hoverBehavior": "default"
  },
  "informationPanel": {
    "groupByEdgeDirection": true,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 0.5,
      "minEdgeSize": 0.2,
      "minNodeSize": 1,
      "maxNodeSize": 7
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}